/**
 * 后台服务api地址
 */

 export const apis = [
   {
     name: '测试服务器',
     url: 'http://172.16.92.250:8760/api',
   },
   {
     name: '杨家兵',
     url: 'http://172.16.92.156:8760/api',
   },
   {
     name: '杨明',
     url: 'http://172.16.92.162:8760/api',
   },
   {
     name: '王华侨',
     url: 'http://172.16.92.31:8760/api',
   },
   {
     name: '廖明杰',
     url: 'http://172.16.92.30:8760/api',
   },
   {
     name: '宋嬴政',
     url: 'http://172.16.92.54:8760/api',
   },
   {
     name: '唐平',
     url: 'http://172.16.92.44:8760/api',
   },
   {
     name: '武望强',
     url: 'http://172.16.92.79:8760/api',
   },
   {
     name: '李建国',
     url: 'http://172.16.92.77:8760/api',
   },
   {
     name: '黄超',
     url: 'http://172.16.92.24:8760/api',
   },
   {
     name: '侯平',
     url: 'http://172.16.92.169:8760/api',
   },
 ]
